Revit 2027 API
CADLinkOptions Properties
The CADLinkOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreserveOverrides |  Whether Revit should preserve the link's graphic overrides on reload.
ViewId |  The id of the view to use as the link's reference view, if the reference view has been deleted.
Top
See Also
Reference
CADLinkOptions Class
Autodesk.Revit.DB Namespace